Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_sci_ex.c
  /* Initialize the SCI State */
  hsci->gState = HAL_SCI_STATE_READY;
  hsci->RxState = HAL_SCI_STATE_READY;

  __HAL_UNLOCK(hsci);

  return HAL_OK;
}

/**
  * @}
  */
/** @defgroup SCIEx_Exported_Functions_Group1 IO operation functions
  * @brief Extended SCI Transmit/Receive functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
    This subsection provides a set of FIFO mode related callback functions.

    (#) Wakeup Callback:
        (+) HAL_SCIEx_WakeupCallback()

    (#) TX/RX Fifos Callbacks:
        (+) HAL_SCIEx_RxFifoFullCallback()
        (+) HAL_SCIEx_TxFifoEmptyCallback()

@endverbatim
  * @{
  */

/**
  * @brief  SCI wake up callback.
  * @param  hsci SCI handle.
  * @retval None
  */
__weak void HAL_SCIEx_WakeupCallback(SCI_HandleTypeDef *hsci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsci);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_SCIEx_WakeupCallback can be implemented in the user file.
   */
}

/**
  * @brief  SCI RX Fifo full callback.
  * @param  hsci SCI handle.
  * @retval None
  */
__weak void HAL_SCIEx_RxFifoFullCallback(SCI_HandleTypeDef *hsci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsci);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_SCIEx_RxFifoFullCallback can be implemented in the user file.
   */
}

/**
  * @brief  SCI TX Fifo empty callback.
  * @param  hsci SCI handle.
  * @retval None
  */
__weak void HAL_SCIEx_TxFifoEmptyCallback(SCI_HandleTypeDef *hsci)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsci);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_SCIEx_TxFifoEmptyCallback can be implemented in the user file.
   */
}

/**
  * @}
  */

/** @defgroup SCIEx_Exported_Functions_Group2 Peripheral Control functions
  * @brief    Extended Peripheral Control functions
  *
@verbatim
 ===============================================================================
                      ##### Peripheral Control functions #####
 ===============================================================================
    [..] This section provides the following functions:
     (+) HAL_SCIEx_EnableFifoMode() API enables the FIFO mode
     (+) HAL_SCIEx_DisableFifoMode() API disables the FIFO mode
     (+) HAL_SCIEx_SetTxFifoThreshold() API sets the TX FIFO threshold
     (+) HAL_SCIEx_SetRxFifoThreshold() API sets the RX FIFO threshold
@endverbatim
  * @{
  */

/**
  * @brief By default in multiprocessor mode, when the wake up method is set
  *        to address mark, the SCI handles only 4-bit long addresses detection;
  *        this API allows to enable longer addresses detection (6-, 7- or 8-bit
  *        long).
  * @note  Addresses detection lengths are: 6-bit address detection in 7-bit data mode,
  *        7-bit address detection in 8-bit data mode, 8-bit address detection in 9-bit data mode.
  * @param hsci         SCI handle.
  * @param AddressLength This parameter can be one of the following values:
  *          @arg @ref SCI_ADDRESS_DETECT_4B 4-bit long address
  *          @arg @ref SCI_ADDRESS_DETECT_7B 6-, 7- or 8-bit long address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SCI_MultiProcessorEx_AddressLength_Set(SCI_HandleTypeDef *hsci, uint32_t AddressLength)
{
  /* Check the SCI handle allocation */
  if (hsci == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the address length parameter */
  assert_param(IS_SCI_ADDRESSLENGTH_DETECT(AddressLength));

  hsci->gState = HAL_SCI_STATE_BUSY;

  /* Disable the Peripheral */
  __HAL_SCI_DISABLE(hsci);

  /* Set the address length */
  MODIFY_REG(hsci->Instance->CR1, USART_CR1_ADDM7, AddressLength);

  /* Enable the Peripheral */
  __HAL_SCI_ENABLE(hsci);

  /* Initialize the SCI State */
  hsci->gState  = HAL_SCI_STATE_READY;
  hsci->RxState = HAL_SCI_STATE_READY;
  
  __HAL_UNLOCK(hsci);

  return HAL_OK;
}

/**
  * @brief  Enable the FIFO mode.
  * @param hsci      SCI handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SCIEx_EnableFifoMode(SCI_HandleTypeDef *hsci)
{
  uint32_t tmpcr1;

  /* Check parameters */
  assert_param(IS_SCI_FIFO_INSTANCE(hsci->Instance));

  /* Process Locked */
  __HAL_LOCK(hsci);

  hsci->gState = HAL_SCI_STATE_BUSY;

  /* Save actual SCI configuration */
  tmpcr1 = READ_REG(hsci->Instance->CR1);

  /* Disable SCI */
  __HAL_SCI_DISABLE(hsci);

  /* Enable FIFO mode */
  SET_BIT(tmpcr1, USART_CR1_FIFOEN);
  hsci->FifoMode = SCI_FIFOMODE_ENABLE;

  /* Restore SCI configuration */
  WRITE_REG(hsci->Instance->CR1, tmpcr1);

  /* Determine the number of data to process during RX/TX SR execution */
  SCIEx_SetNbDataToProcess(hsci);

  hsci->gState = HAL_SCI_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hsci);

  return HAL_OK;
}

/**
  * @brief  Disable the FIFO mode.
  * @param  hsci SCI handle.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SCIEx_DisableFifoMode(SCI_HandleTypeDef *hsci)
{
  uint32_t tmpcr1;

  /* Check parameters */
  assert_param(IS_SCI_FIFO_INSTANCE(hsci->Instance));

  /* Process Locked */
  __HAL_LOCK(hsci);

  hsci->gState = HAL_SCI_STATE_BUSY;

  /* Save actual SCI configuration */
  tmpcr1 = READ_REG(hsci->Instance->CR1);

  /* Disable SCI */
  __HAL_SCI_DISABLE(hsci);

  /* Disable FIFO mode */
  CLEAR_BIT(tmpcr1, USART_CR1_FIFOEN);
  hsci->FifoMode = SCI_FIFOMODE_DISABLE;

  /* Restore SCI configuration */
  WRITE_REG(hsci->Instance->CR1, tmpcr1);

  hsci->gState = HAL_SCI_STATE_READY;

  /* Process Unlocked */
  __HAL_UNLOCK(hsci);

  return HAL_OK;
}

/**
  * @brief  Set the TXFIFO threshold.
  * @param hsci      SCI handle.
  * @param Threshold  TX FIFO threshold value
  *          This parameter can be one of the following values:
  *            @arg @ref SCI_TXFIFO_THRESHOLD_1_8
  *            @arg @ref SCI_TXFIFO_THRESHOLD_1_4
  *            @arg @ref SCI_TXFIFO_THRESHOLD_1_2
  *            @arg @ref SCI_TXFIFO_THRESHOLD_3_4
  *            @arg @ref SCI_TXFIFO_THRESHOLD_7_8
  *            @arg @ref SCI_TXFIFO_THRESHOLD_8_8
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SCIEx_SetTxFifoThreshold(SCI_HandleTypeDef *hsci, uint32_t Threshold)
{
  uint32_t tmpcr1;

  /* Check parameters */
  assert_param(IS_SCI_FIFO_INSTANCE(hsci->Instance));
  assert_param(IS_SCI_TXFIFO_THRESHOLD(Threshold));

  /* Process Locked */
  __HAL_LOCK(hsci);

  hsci->gState = HAL_SCI_STATE_BUSY;

